Merge pull request #18 from serpcompany/17-refactor-the-staging-mirror-db-to-match-production-prev
17 refactor the staging mirror db to match production prev
